ednieuw/RTCcheck/ESP32_RTCcheckV006/ESP32_RTCcheckV006.ino
  // NTP time already in local time
  time_t tNTP = mktime(&timeinfo);

  RTCdiffSec[i] = abs(tNTP - tRTC);
 }
} 

//--------------------------------------------                       //
// RTC8 Update the time difference in the LEDs
// 1 second sec * -10 GREEN sec * 10 RED
// BLUE is empty
// max time difference = 25 seconds. 26 = NA
//--------------------------------------------
void UpdateRTCTimeLEDs(void)
{
 CalcDifRTCtimes();                                                 // Calculate difference in sec from NTP
 for (int i = 0; i < MAX_RTC; i++)                                  // Read time of all ACTIVE RTC modules
  {
   int c;
   if (!rtcActive[i]) c = 26;                                     // Skip non-active RTC's 
   else c = RTCdiffSec[i]; 
   switch (c)
    {
      case  0:        ColorLed(i,green);        break;
      case  1 ...  2: ColorLed(i,orange);       break;
      case  3 ...  4: ColorLed(i,grass);        break;
      case  5 ...  6: ColorLed(i,marine);       break;
      case  7 ... 10: ColorLed(i,darkviolet);   break;
      case 11 ... 17: ColorLed(i,pink);         break;
      case 18 ... 25: ColorLed(i,purple);       break;
      case 26:        ColorLed(i,blue);         break;
      default:        ColorLed(i,red); 
    }
  }
ShowLeds(); 
}

//--------------------------------------------                       //
// RTC8 Print RTC differences from NTP
//--------------------------------------------
void PrintDifRTCtimes(void)
{
 Tekstprint(" ");
 CalcDifRTCtimes();
 for (int i = 0; i < MAX_RTC; i++) 
  {  
   if (!rtcActive[i]) { continue; } 
   sprintf(sptext,"|T%d:%2ld",i,RTCdiffSec[i]);
   Tekstprint(sptext);
  }
 Tekstprint("| ");
}
//--------------------------------------------                       //
// RTC8 Function to select TCA9548A channel
//--------------------------------------------
void selectTCAChannel(uint8_t channel) 
{
  if (channel > 7) return;                                           // Maximaal 8 kanalen (0-7)
  Wire.beginTransmission(TCA_ADDR);
  Wire.write(1 << channel);                                          // Select channel by setting bit
  uint8_t error = Wire.endTransmission();
  
  if (error != 0) 
   {
    sprintf(sptext,"Error selecting channel %d Error code : %d", channel,error);
    Tekstprintln(sptext);  
  }
  delay(10);                                                         // short delay after channel change
}
//--------------------------------------------                       //
// RTC8 set Time For RTC 
//--------------------------------------------
void setTimeForRTC(int rtcIndex, DateTime newTime) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  rtc[rtcIndex].adjust(newTime);
}
//--------------------------------------------                       //
// RTC8 Print Time For RTC 
//--------------------------------------------
void printTimeForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return;
  selectTCAChannel(rtcIndex);
  DateTime now = rtc[rtcIndex].now();

  sprintf(sptext,"RTC %d: %s", rtcIndex, now.timestamp(DateTime::TIMESTAMP_FULL).c_str());
  Tekstprintln(sptext);  
}
//--------------------------------------------                       //
// RTC8 get Temperature For RTC
//--------------------------------------------
float getTemperatureForRTC(int rtcIndex) 
{
  if (!rtcActive[rtcIndex]) return -999;
  selectTCAChannel(rtcIndex);
  return rtc[rtcIndex].getTemperature();
}
//--------------------------------------------                                                //
// RTC8 Synchronize all RTC's with current time
//--------------------------------------------
void synchronizeAllRTCs()   // Zoek eerste actieve RTC als referentie
{
  int referenceRTC = -1;
  for (int i = 0; i < MAX_RTC; i++) 
     {  if (rtcActive[i]) { referenceRTC = i;  break;  }  }
  if (referenceRTC == -1) 
     {  Serial.println("No active RTC's found!");   return;  }
  
  selectTCAChannel(referenceRTC);
  DateTime referenceTime = rtc[referenceRTC].now();
  Tekstprintln("\n=== RTC SYNCHRONISATION ===");

    sprintf(sptext,"Reference time of RTC  %d loops/s",referenceRTC);
  Tekstprintln(sptext); 

  Serial.println("\n=== RTC SYNCHRONISATION ===");
  Serial.print("Reference time of RTC ");
  Serial.print(referenceRTC);
  Serial.print(": ");
  Serial.println(referenceTime.timestamp(DateTime::TIMESTAMP_FULL));
  
  for (int i = 0; i < MAX_RTC; i++) 
   {
    if (!rtcActive[i]) continue;
    selectTCAChannel(i);
    delay(50);
    DateTime before = rtc[i].now();                                  // Show time before update
    Serial.print("RTC ");
    Serial.print(i);
    Serial.print(" before sync: ");
    Serial.println(before.timestamp(DateTime::TIMESTAMP_FULL));
    rtc[i].adjust(referenceTime);                                    // Update time
    delay(100); 
    DateTime after = rtc[i].now();                                   // Verify
    Serial.print("RTC ");
    Serial.print(i);
    Serial.print(" after sync:  ");
    Serial.println(after.timestamp(DateTime::TIMESTAMP_FULL));
  }
 Serial.println("Synchronisation done!\n");
}

//--------------------------------------------                       //
// RTC8 Set time by hand in serial monitor
//--------------------------------------------
void setCurrentTime() 
{
   int year, month, day, hour, minute, second;                        // Parse input met sscanf (simpler than strtok)
  // int parsed = sscanf(input.c_str(), "%d %d %d %d %d %d", &year, &month, &day, &hour, &minute, &second);
  
  hour   = timeinfo.tm_hour;
  minute = timeinfo.tm_min;
  second = timeinfo.tm_sec;
  year   = timeinfo.tm_year + 1900;                                                      // Inow.year() is years since 2000 tm_year is years since 1900
  month  = timeinfo.tm_mon + 1;
  day    = timeinfo.tm_mday;
  int parsed = 6;
  if (parsed == 6) 
  {
    DateTime newTime(year, month, day, hour, minute, second);
    Serial.print("New time: ");
    Serial.println(newTime.timestamp(DateTime::TIMESTAMP_FULL));
    
    for (int i = 0; i < MAX_RTC; i++) 
    {
      if (!rtcActive[i]) continue;
      selectTCAChannel(i);
      delay(50);
      
